# Analyse de la qualité des données

## Chargement des données brut

In [128]:
from getting_started import df_patient, df_pcr

df_patient[10000:10010]

,patient_id,given_name,surname,street_number,address_1,suburb,postcode,state,date_of_birth,age,phone_number,address_2
10000,724152,emiily,normandale,30.0,bentham street,wingham,2630,nsw,19880310.0,26.0,04 35932541,None
10001,248620,chevonne,xepapas,22.0,strzelecki crescent,coniston,5034,tas,19381119.0,30.0,08 46573033,pine dale
10002,508294,nathan,huddy,45.0,catchpole street,brighton,2020,nsw,19210106.0,30.0,04 79805505,None
10003,498635,damien,albert-ward,49.0,wangara street,hawthorne,2284,wa,19740925.0,33.0,02 53766926,sec 1 hd molineux
10004,266562,thomas,wynne,17.0,bollard street,baddaginnie,5022,nsw,19000221.0,24.0,08 70262669,None
10005,307158,fraser,cuming,71.0,namadgi circuit,pemberton,3082,qld,19811227.0,NaN,07 12997176,None
10006,739446,michael,blake,5.0,gang gang court,mosman,4300,sa,19060126.0,31.0,04 81256468,None
10007,101468,riley,liddy,93.0,symers street,None,4660,vic,19971109.0,36.0,07 61650835,marshanti arabians
10008,386453,blake,huxley,27.0,burrell street,miami,None,nsw,19630527.0,27.0,02 09031240,warrion rsd
10009,172255,rachel,mosmondor,3.0,badimara street,frankston,4551,nsw,19940407.0,39.0,07 90052168,sydney road

In [96]:
df_patient = df_patient.convert_dtypes()
df_patient.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   patient_id     20000 non-null  Int64
 1   given_name     19560 non-null  string
 2   surname        19575 non-null  string
 3   street_number  19618 non-null  Int64
 4   address_1      19204 non-null  string
 5   suburb         19788 non-null  string
 6   postcode       19801 non-null  string
 7   state          18010 non-null  string
 8   date_of_birth  17989 non-null  Int64
 9   age            16003 non-null  Int64
 10  phone_number   19081 non-null  string
 11  address_2      7893 non-null   string
dtypes: Int64(4), string(8)
memory usage: 1.9 MB

In [97]:
df_pcr = df_pcr.convert_dtypes()
df_pcr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8800 entries, 0 to 8799
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   patient_id  8800 non-null   Int64
 1   pcr         8800 non-null   string
dtypes: Int64(1), string(1)
memory usage: 146.2 KB

In [98]:
df_patient.head(10)

,patient_id,given_name,surname,street_number,address_1,suburb,postcode,state,date_of_birth,age,phone_number,address_2
0,221958,matisse,clarke,13,rene street,ellenbrook,2527,wa,19710708,32,08 86018809,westella
1,771155,joshua,elrick,23,andrea place,east preston,2074,nsw,19120921,34,02 97793152,foxdown
2,231932,alice,conboy,35,mountain circuit,prospect,2305,nsw,19810905,22,02 20403934,<NA>
3,465838,sienna,craswell,39,cumberlegeicrescent,henty,3620,wa,19840809,30,02 62832318,jodane
4,359178,joshua,bastiaans,144,lowrie street,campbell town,4051,nsw,19340430,31,03 69359594,<NA>
5,744167,ky,laing,448,nyawi place,barmera,3556,qld,19050919,32,03 59872070,<NA>
6,210268,matthew,laing,11,barnes place,laurieton,2160,nsw,19061018,29,02 86925029,<NA>
7,832180,jack,renfrey,27,osmand street,maribyrnong,2170,qld,19610518,31,03 15575583,dhurringill
8,154886,adele,ryan,76,house circuit,new farm,2200,qld,19430102,33,07 37444521,<NA>
9,237337,breeanne,wynne,12,cowper street,bonnet bay,2062,qld,19030606,35,08 24888117,<NA>

In [99]:
df_pcr.head(10)

   patient_id       pcr
0      653091         N
1      347667  Negative
2      708481  Positive
3      148825  Negative
4      150081  Negative
5      876796         N
6      169224  Negative
7      755915         P
8      374486         N
9      634003         N

In [23]:
df_pcr.pcr.value_counts()

N           3482
Negative    3134
Positive    1283
P            901
Name: pcr, dtype: Int64

## Index métier `patient_id` unique ?

Nombre de patients avec `patient_id` dupliqué

In [26]:
df_patient.patient_id.duplicated().sum()

202

Nombre de tests PCR associés à un `patient_id` dupliqué

In [29]:
df_pcr.patient_id.isin(df_patient[df_patient.patient_id.duplicated()].patient_id).sum()

168

## Analyse des noms et prénoms

Valeurs manquantes :

In [61]:
df_patient[["given_name", "surname"]].isna().value_counts()

given_name  surname
False       False      19139
True        False        436
False       True         421
True        True           4
dtype: int64

## Analyse des âges et dates de naissance

Valeurs manquantes :

In [64]:
df_patient[["age", "date_of_birth"]].isna().value_counts()

age    date_of_birth
False  False            14391
True   False             3598
False  True              1612
True   True               399
dtype: int64

Dates de naissance invalides :

In [125]:
from pandas import to_datetime

df_patient["dob_datetime"] = to_datetime(
    df_patient.date_of_birth,
    errors="coerce",
    unit="D",
    origin="unix",
    utc=False,
)

df_patient[1000:1010]

OutOfBoundsDatetime: Out of bounds nanosecond timestamp: 55936-02-02 00:00:00

In [75]:
df_patient.date_of_birth[
    df_patient.date_of_birth.notna() & \
    df_patient.dob_datetime.isna()
]

40       19030539
145      19179318
244      19541242
481      19990353
539      19328814
           ...
19843    19181527
19875    19339919
19928    19550480
19949    19910237
19952    19120978
Name: date_of_birth, Length: 174, dtype: Int64

Incohérences entre âge déclaré et calculé :

In [93]:
from datetime import datetime
df_patient["age_from_dob"] = ((datetime.today() - df_patient["dob_datetime"].dropna()).dt.days).floordiv(365)

df_patient.head(20)

,patient_id,given_name,surname,street_number,address_1,suburb,postcode,state,date_of_birth,age,phone_number,address_2,dob_datetime,age_from_dob
0,221958,matisse,clarke,13,rene street,ellenbrook,2527,wa,19710708,32,08 86018809,westella,1971-07-08,49.0
1,771155,joshua,elrick,23,andrea place,east preston,2074,nsw,19120921,34,02 97793152,foxdown,1912-09-21,108.0
2,231932,alice,conboy,35,mountain circuit,prospect,2305,nsw,19810905,22,02 20403934,<NA>,1981-09-05,39.0
3,465838,sienna,craswell,39,cumberlegeicrescent,henty,3620,wa,19840809,30,02 62832318,jodane,1984-08-09,36.0
4,359178,joshua,bastiaans,144,lowrie street,campbell town,4051,nsw,19340430,31,03 69359594,<NA>,1934-04-30,86.0
5,744167,ky,laing,448,nyawi place,barmera,3556,qld,19050919,32,03 59872070,<NA>,1905-09-19,115.0
6,210268,matthew,laing,11,barnes place,laurieton,2160,nsw,19061018,29,02 86925029,<NA>,1906-10-18,113.0
7,832180,jack,renfrey,27,osmand street,maribyrnong,2170,qld,19610518,31,03 15575583,dhurringill,1961-05-18,59.0
8,154886,adele,ryan,76,house circuit,new farm,2200,qld,19430102,33,07 37444521,<NA>,1943-01-02,77.0
9,237337,breeanne,wynne,12,cowper street,bonnet bay,2062,qld,19030606,35,08 24888117,<NA>,1903-06-06,117.0
10,621430,michael,white,17,farrer street,flagstaff hill,3971,nt,19830308,30,08 61399758,<NA>,1983-03-08,37.0
11,187498,<NA>,mason,20,padbury street,granville,6239,qld,19201021,38,03 85186450,pioneer lodge,1920-10-21,99.0
12,999159,joshua,bristow,21,thake place,oxley vale,7004,nsw,19650125,33,08 93848698,<NA>,1965-01-25,55.0
13,275203,max,godfrey,166,givens street,leichhardt,4152,nsw,19860908,6,07 88425978,<NA>,1986-09-08,34.0
14,291335,mikayla,paterson,20,freda bennett circuit,dover heights,4670,qld,19810810,<NA>,08 88377793,<NA>,1981-08-10,39.0
15,378167,cain,scarles,58,reader court,dorrigo,2428,qld,<NA>,31,03 67476384,jorobe,NaT,NaN
16,141090,georgia,white,117,burston place,conder,4127,nsw,19920702,40,07 53985196,<NA>,1992-07-02,28.0
17,429365,<NA>,coffey,1409,musson close,beaconsfield upper,5019,wa,<NA>,30,03 13369308,silverweir,NaT,NaN
18,164820,lia,wilde,30,elsey street,<NA>,3109,qld,19070704,<NA>,03 98048163,<NA>,1907-07-04,113.0
19,887201,mitchekl,stephenskon,58,rosman circuit,eastwood,2359,sa,19320814,39,03 85151806,<NA>,1932-08-14,88.0

Sanitize date of birth

In [51]:
df_patient_dob_age_not_sanitized = df_patient.loc[df_patient.date_of_birth.notna() & df_patient.dob_sanitized.isna(), ["patient_id", "date_of_birth", "age"]]

In [57]:
df_patient_dob_with_age = df_patient_dob_not_sanitized.loc[df_patient_dob_age_not_sanitized.age.notna(), ["patient_id", "age"]]
df_patient_dob_with_age.head()

     patient_id  age
40       627035   36
145      921654   24
244      691460   39
539      200235   39
635      431593   23

In [63]:
from datetime import datetime
df_patient_dob_with_age["dob_sanitized"] = pd.to_datetime(datetime.today().year - df_patient_dob_with_age.age, format="%Y")

df_patient_dob_with_age.head()

     patient_id  age dob_sanitized
40       627035   36    1984-01-01
145      921654   24    1996-01-01
244      691460   39    1981-01-01
539      200235   39    1981-01-01
635      431593   23    1997-01-01

In [95]:
df_patient_dob_without_age = df_patient_dob_age_not_sanitized.loc[df_patient_dob_age_not_sanitized.age.isna(), ["patient_id", "date_of_birth"]]

df_patient_dob_without_age["dob_sanitized"] = pd.to_datetime(df_patient_dob_without_age.date_of_birth.astype("string").str[:4], format="%Y")

df_patient_dob_without_age["age_sanitized"] = ((datetime.today() - df_patient_dob_without_age.dob_sanitized).dt.days / 365).astype("int")

df_patient_dob_without_age.head()

      patient_id  date_of_birth dob_sanitized  age_sanitized
481       584299       19990353    1999-01-01             21
1047      211195       19918215    1991-01-01             29
2591      805475       19303111    1930-01-01             90
2706      293510       19803504    1980-01-01             40
3149      279830       19512201    1951-01-01             69

In [98]:
df = df_patient\
    .combine_first(df_patient_dob_with_age)\
    .combine_first(df_patient_dob_without_age)

In [101]:
df.iloc[481]

address_1            cantor crescent
address_2                       <NA>
age                             <NA>
age_sanitized                     21
date_of_birth               19990353
dob_sanitized    1999-01-01 00:00:00
given_name                     ethan
patient_id                    584299
phone_number             04 43439217
postcode                        3419
state                            nsw
street_number                     20
suburb                     westfield
surname                      girdler
Name: 481, dtype: object

In [104]:
df.loc[df.dob_sanitized.fillna(df.date_of_birth).isna(), ["patient_id", "dob_sanitized"]]

      patient_id dob_sanitized
15        378167           NaT
17        429365           NaT
22        427069           NaT
29        284779           NaT
34        600186           NaT
...          ...           ...
19968     902251           NaT
19975     752160           NaT
19984     134889           NaT
19994     912344           NaT
19997     511885           NaT

[2011 rows x 2 columns]

## Duplication

In [128]:
df_patient_duplicated_id = df_patient[df_patient.duplicated(subset="patient_id", keep=False)].sort_values(by="patient_id")

In [151]:
df_patient_invalid_state = df_patient[~df_patient.state.str.upper().isin(["NSW", "VIC", "QLD", "WA", "SA", "TAS", "ACT", "NT"])]

df_patient_invalid_state.state.count()

139

## Sanitize postcode and state

Assume postcode is more reliable than state.
Test all postcodes are valid.
Case postcode invalid, try swap with suburb.
Test some state are invalid.
Normalize state with typos.
For missing or invalid states, guess from postcode.
Keep state if postcode invalid.

In [161]:
df_patient.state = df_patient.state.str.upper()
df_patient_invalid_postcode = df_patient[df_patient.state.isin(["NSW", "VIC", "QLD", "WA", "SA", "TAS", "ACT", "NT"])]
df_patient_vic = df_patient_invalid_postcode.loc[df_patient_invalid_postcode.state == "VIC"]
df_patient_vic.loc[~df_patient_vic.postcode.str.match(r"[3|8]\d{3}")].head()

,patient_id,given_name,surname,street_number,address_1,suburb,postcode,state,date_of_birth,age,phone_number,address_2,dob_sanitized
24,299041,harrison,neumann,60,eggleston crescent,tweed heads,2560,VIC,19700617,22,04 13196831,<NA>,1970-06-17
35,256730,xani,soulemezis,34,macrossan rescent,mullumbimby creek,2192,VIC,19890205,<NA>,07 24955924,sec 1,1989-02-05
37,484681,chloe,gimbrere,53,o'connor circuit,wynnum west,2317,VIC,19130421,28,08 69503221,<NA>,1913-04-21
42,552366,dylan,leane,158,byrne street,landsborough,2528,VIC,<NA>,<NA>,07 12047561,<NA>,NaT
48,428947,abbie,fitzpatrick,7,jacka crescent,prospect,5091,VIC,19700122,35,03 41475097,<NA>,1970-01-22

## Sanitize phone numbers

- Format XX XXXXXXXX, 04 if mobile
- Must be coherent with postcode

In [170]:
df_patient.loc[~df_patient.phone_number.str.match(r"\d{2}\s\d{8}")].phone_number.count()

0

## Phone number as possible identifier

In [176]:
df_patient[df_patient.phone_number.duplicated(keep=False)].sort_values(by="phone_number").head(20)

,patient_id,given_name,surname,street_number,address_1,suburb,postcode,state,date_of_birth,age,phone_number,address_2,dob_sanitized
2634,311830,taaila,<NA>,16,mcnicoll place,orange,6230,VIC,19180603,<NA>,02 00325977,<NA>,1918-06-03
3872,210155,taalia,<NA>,19,mcnicollyplace,orange,6230,VIC,19180603,64,02 00325977,<NA>,1918-06-03
16605,525466,taalia,<NA>,19,mcnicoll place,orange,6230,VIC,19180603,26,02 00325977,<NA>,1918-06-03
248,870746,tyler,able,15,marcus clarke street,wannissa,3333,NSW,19830504,<NA>,02 00493853,<NA>,1983-05-04
4986,268616,tyler,able,154,marcus clarke street,wanniassa,3333,NSW,19830504,<NA>,02 00493853,<NA>,1983-05-04
2706,293510,tyler,able,154,marcus clarke street,wanniasa,3333,NSW,19803504,<NA>,02 00493853,<NA>,NaT
3173,123387,adam,schumajnn,4,bunurung close,bonython,2289,NSW,19270326,23,02 01272164,<NA>,1927-03-26
635,431593,adam,schumann,20,bunurung close,bonython,2289,NSW,19279326,23,02 01272164,<NA>,NaT
16029,375877,adam,schumann,20,bunurung close,bonython,2289,NSW,19270326,23,02 01272164,<NA>,1927-03-26
12604,505218,adam,schumann,20,bunurunqaqclose,bonython,2289,NSW,19270326,23,02 01272164,<NA>,1927-03-26
4055,953966,to,godfrey,26,jefferis street,dimboola,3939,WS,19780806,32,02 01871708,<NA>,1978-08-06
7141,405442,thomas,godfrey,26,jefferis street,dimboola,3939,WA,19780806,32,02 01871708,<NA>,1978-08-06
561,814998,tahlia,coleman,24,furey street,boondall,3163,NSW,19000310,24,02 02079822,<NA>,1900-03-10
7101,340011,tahlia,coleman,24,furey street,boondall,3163,NSW,19000310,19,02 02079822,<NA>,1900-03-10
6086,669354,jacob,svenson,48,wagga soreet,kempsey,2009,QOD,19431221,31,02 03546747,walhalla,1943-12-21
13795,909797,jaob,svenson,48,wagga smreet,kempsey,2009,QLD,19431221,31,02 03546747,walhalla,1943-12-21
7365,576055,jacob,svenson,98,wagga street,kempsey,2009,QLF,<NA>,31,02 03546747,walhalla,NaT
1201,489678,jacob,svenson,48,wagga street,kempsey,2009,QLD,19431221,31,02 03546747,walhalla,1943-12-21
12943,950122,<NA>,petersen,19,thomsoj street,botany,5108,NSS,19170329,41,02 03687263,solitary split caravn park,1917-03-29
17544,399260,<NA>,peterssen,10,thomson street,botany,5108,NSW,19173029,41,02 03687263,split solitary caravn park,NaT

In [189]:
df_patient.loc[
    df_patient.duplicated(subset=["given_name", "surname"], keep=False),
    ["given_name", "surname", "phone_number"]
].groupby(
    ["given_name", "surname"]
).count().sort_values(by=["phone_number"], ascending=False).head(20)

                     phone_number
given_name surname
emiily     white               14
           green               12
joshua     campbell            10
emiily     ryan                10
william    white               10
joshua     white               10
emiily     nguyen               9
thomas     webb                 9
liam       clarke               9
emiily     clarke               9
thomas     white                8
joshua     green                8
riley      white                8
lachlan    clarke               8
liam       white                7
james      webb                 7
matthew    white                7
connor     clarke               7
lachlan    white                7
brianna    nguyen               7